In [1]:
import pandas as pd

In [5]:
name = ["Gaurav", "anupam", "javed", "madhu", "anumeha", "sandeep"]
scores = [9,8,7.5,8,9,10]
rating = [5,3,5,4,4.5,3.5]

In [8]:
students_dict = {"Names": name, "Scores": scores, "Ratings": rating}

In [9]:
students = pd.DataFrame(students_dict)

In [10]:
students

     Names  Scores  Ratings
0   Gaurav     9.0      5.0
1   anupam     8.0      3.0
2    javed     7.5      5.0
3    madhu     8.0      4.0
4  anumeha     9.0      4.5
5  sandeep    10.0      3.5

In [11]:
type(students)

pandas.core.frame.DataFrame

In [13]:
type(students['Scores'])

pandas.core.series.Series

In [14]:
students[['Scores','Ratings']]

   Scores  Ratings
0     9.0      5.0
1     8.0      3.0
2     7.5      5.0
3     8.0      4.0
4     9.0      4.5
5    10.0      3.5

In [40]:
a = pd.read_csv("ex1.csv", header= None, =[4,5,6,7])

In [41]:
a

    4   5   6        7
a   b   c   d  message
1   2   3   4    hello
5   6   7   8    world
9  10  11  12      foo

In [22]:
a.head(2)

   0  1  2  3        4
0  a  b  c  d  message
1  1  2  3  4    hello

In [23]:
a.tail(2)

   0   1   2   3      4
2  5   6   7   8  world
3  9  10  11  12    foo

In [24]:
a.dtypes

0    object
1    object
2    object
3    object
4    object
dtype: object

In [25]:
students.dtypes

Names       object
Scores     float64
Ratings    float64
dtype: object

In [27]:
pd.read_table("test.tsv", header=None)

       0      1      2      3      4      5
0   sudh   sudh   sudh   sudh   sudh   sudh
1  kumar  kumar  kumar  kumar  kumar  kumar

In [31]:
pd.read_csv("test.tsv", header=None, sep='\t')

       0      1      2      3      4      5
0   sudh   sudh   sudh   sudh   sudh   sudh
1  kumar  kumar  kumar  kumar  kumar  kumar

In [34]:
b = pd.read_csv("ex4.csv", skiprows=[0,2,3])

In [35]:
b

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [36]:
students

     Names  Scores  Ratings
0   Gaurav     9.0      5.0
1   anupam     8.0      3.0
2    javed     7.5      5.0
3    madhu     8.0      4.0
4  anumeha     9.0      4.5
5  sandeep    10.0      3.5

In [77]:
students.shape

(6, 3)

In [78]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Names      6 non-null object
Scores     6 non-null float64
Ratings    6 non-null float64
dtypes: float64(2), object(1)
memory usage: 272.0+ bytes

In [79]:
students.describe()

          Scores   Ratings
count   6.000000  6.000000
mean    8.583333  4.166667
std     0.917424  0.816497
min     7.500000  3.000000
25%     8.000000  3.625000
50%     8.500000  4.250000
75%     9.000000  4.875000
max    10.000000  5.000000

In [37]:
a

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [44]:
students.to_csv("students.csv", sep="@")

In [43]:
pwd()

'C:\\Users\\SHIVAM SINGH\\Documents\\Python Online Session\\Pandas_in_Depth'

In [45]:
s = pd.Series(["trainer", "ML", 23,96,"rating",49], index=["shivam", "DL", "DOB", 56, 5, 16])

In [46]:
s

shivam    trainer
DL             ML
DOB            23
56             96
5          rating
16             49
dtype: object

In [47]:
s['DL']

'ML'

In [49]:
s[56]

96

In [50]:
import csv

In [53]:
f = open("ex7.csv")

In [56]:
f

In [54]:
c = csv.reader(f)

In [55]:
c

In [57]:
for i in c:
    print(i)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [58]:
with open ("ex7.csv") as f:
    lines = list(csv.reader(f))

In [59]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [60]:
a = [4,5,6,7]
b = [3,4,6]
c = [3,9,10]

In [61]:
list(zip(a,b,c))

[(4, 3, 3), (5, 4, 9), (6, 6, 10)]

In [62]:
lines[1:]

[['1', '2', '3'], ['1', '2', '3']]

In [69]:
list(zip(lines[1],lines[2]))

[('1', '1'), ('2', '2'), ('3', '3')]

In [66]:
k, v = lines[0], lines[1:]

In [67]:
k

['a', 'b', 'c']

In [68]:
v

[['1', '2', '3'], ['1', '2', '3']]

In [75]:
list(zip(*v))

[('1', '1'), ('2', '2'), ('3', '3')]

In [76]:
{k : v for k,v in zip(k, zip(*v))}

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}